In [1]:
import pandas as pd
df1 = pd.read_csv('2-Username.csv')
df2 = pd.read_csv('2-Userid.csv')

In [2]:
print(df1)

   userid      name
0     111    'mark'
1     444    'mark'
2     222    'mark'
3     333  'sourav'
4     555  'sheryl'

In [3]:
print(df2)

   userid  age   country
0     111   47   'India'
1     222   45   'India'
2     333   23   'Italy'
3     444   47   'Italy'
4     555   28  'Canada'

In [16]:
group1_mean = df2.groupby('country').mean()

In [19]:
# Question 1. Select all countries with average age > 45
group1[group1['age'] >= 45]

         userid   age
country
'India'   166.5  46.0

In [20]:
group2_count = df1.groupby('name').count()

In [21]:
print(group2_count)

          userid
name
'mark'         3
'sheryl'       1
'sourav'       1

In [22]:
# Question 2. Find all userids whose names are unique, i.e. there is no other userid with the same name.
group2_count[group2_count['userid'] == 1]

          userid
name
'sheryl'       1
'sourav'       1